In [12]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
# Utilizando merge y joins obtener un dataframe como resultado de los tres anteriores 

df12 = pd.merge(df1,df2,on="employee")
df_full = pd.merge(df12,df3,on = "group")
df_full

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [13]:
# Generar un nuevo dataframe que contenga el resultado de los tres anteriores y df4
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']})

In [14]:
df_full = pd.merge(df_full,df4,left_on="employee",right_on="applier")
df_full

  employee        group  hire_date supervisor applier          position
0      Bob   Accounting       2008      Carly     Bob               CTO
1     Jake  Engineering       2012      Guido    Jake  Senior Developer
2     Lisa  Engineering       2004      Guido    Lisa               CFO
3      Sue           HR       2014      Steve     Sue        Head of HR

In [18]:
# Utilizar el método drop() para eliminar las columnas redudantes
df_full = df_full.drop("employee", axis=1)
df_full

         group  hire_date supervisor applier          position
0   Accounting       2008      Carly     Bob               CTO
1  Engineering       2012      Guido    Jake  Senior Developer
2  Engineering       2004      Guido    Lisa               CFO
3           HR       2014      Steve     Sue        Head of HR

In [22]:
df1 = pd.DataFrame({"a":[1],"b":[2],"c":[3]})
df2 = pd.DataFrame({"a":[1,4],"b":[7,9],"c":[8,9]})
# Utilizando los DataFrames anteriores realizar un inner, outer, left y right join entre ellos.
# Antes de ejecutar cada join escribir un comentario con el output esperado.

   a  b  c
0  1  2  3

   a  b  c
0  1  7  8
1  4  9  9

In [23]:
# INNER JOIN: Si unimos por la columna "a" se espera que aparezcan las columnas b y c con nuevos nombres
# para el primer renglón del segundo dataframe.

pd.merge(df1,df2,on="a",how="inner")

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

In [25]:
# LEFT JOIN: En este caso, se espera el mismo resultado que con inner

pd.merge(df1,df2,on="a",how="left")

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

In [27]:
# OUTTER JOIN: Se espera que traiga los dos casos con las columnas b y c en null para el segundo caso.

pd.merge(df1,df2,on="a",how="outer")

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9

In [28]:
# RIGHT JOIN: En este caso, se espera el mismo resultado que con outter 

pd.merge(df1,df2,on="a",how="outer")

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9